# git - система управления версиями кода

# github - сайт,который дает хранилище для кода

# также есть gitlab,bitbucket
# репозитории - папка с проектом с которой может работать git

# ssh-keygen - создание ключа

# git config --global user.name "your-name"
# git config --global user.email "your-email"
# указание своих данных

# git init - превратить папку в репозитории и создает папку .git

# a = 10
# print(10)
# print(10)


# создаете репозитории на github
# gti remote add origin <ссылка на ропезитории> - добавить ссылку на репозитории в переменную origin

# dit add . / filename - добавляет указанные файлы в индекс / начинает     отслеживание файлов

# git commit -m "название для версии" - создание версии кода / создать сохранение кода

# git push origin имя_ветки - отправить версию кода на github

# git status - проверка состояния

# git log - список 
# git log --oneline

# git clone <ссылка на репозитории> - скачать проект с репозитория / склонить проект

